{
    "number": 137521,
    "title": "[flang][OpenMP] Allow UPDATE clause to not have any arguments",
    "body": "The UPDATE clause can be specified on both ATOMIC and DEPOBJ directives. Currently, the ATOMIC directive has its own handling of it, and the definition of the UPDATE clause only supports its use in the DEPOBJ directive, where it takes a dependence-type as an argument.\r\n\r\nThe UPDATE clause on the ATOMIC directive may not have any arguments. Since the implementation of the ATOMIC construct will be modified to use the standard handling of clauses, the definition of UPDATE should reflect that.",
    "created_at": "2025-04-27T15:02:13Z",
    "merged_at": "2025-05-01T18:30:45Z",
    "user": "kparzysz",
    "files": [
        "flang/include/flang/Parser/parse-tree.h",
        "flang/lib/Lower/OpenMP/Clauses.cpp",
        "flang/lib/Parser/openmp-parsers.cpp",
        "flang/lib/Semantics/check-omp-structure.cpp",
        "llvm/include/llvm/Frontend/OpenMP/OMP.td"
    ],
    "commits": [
        "[flang][OpenMP] Mark atomic clauses as unique\n\nThe current implementation of the ATOMIC construct handles these clauses\nindividually, and this change does not have an observable effect. At the\nsame time these clauses are unique as per the OpenMP spec, and this patch\nreflects that in the OMP.td file.",
        "[flang][OpenACC][OpenMP] Separate implementations of ATOMIC constructs\n\nThe OpenMP implementation of the ATOMIC construct will change in the\nnear future to accommodate OpenMP 6.0. This patch separates the shared\nimplementations to avoid interfering with OpenACC.",
        "[flang][OpenMP] Allow UPDATE clause to not have any arguments\n\nThe UPDATE clause can be specified on both ATOMIC and DEPOBJ directives.\nCurrently, the ATOMIC directive has its own handling of it, and the\ndefinition of the UPDATE clause only supports its use in the DEPOBJ\ndirective, where it takes a dependence-type as an argument.\n\nThe UPDATE clause on the ATOMIC directive may not have any arguments.\nSince the implementation of the ATOMIC construct will be modified to\nuse the standard handling of clauses, the definition of UPDATE should\nreflect that.",
        "Merge branch 'main' into users/kparzysz/spr/a03-update-clause"
    ]
}